# cfg/base_yolov12n_p2.yaml
# YOLOv12n + P2 detect head (module 1: shallow-feature retention)
# Dung khi --modules chua 1. build_model.py chon file nay thay vi base_yolov12n.yaml.

nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # GIU NGUYEN baseline - index 0..8 nhu base_yolov12n.yaml
  - [-1, 1, Conv,  [64, 3, 2]]          # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1  P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2  P2 feat (shallow, stride 4)
  - [-1, 1, Conv,  [256, 3, 2]]         # 3  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4  (<- module 2: SFDF)
  - [-1, 1, Conv,  [512, 3, 2]]         # 5  P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6
  - [-1, 1, Conv,  [1024, 3, 2]]        # 7  P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]     # 8

head:
  # ---- top-down (FPN) ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 6], 1, Concat, [1]]                     # 10
  - [-1, 2, A2C2f, [512, False, -1]]              # 11 P4 (<- module 5: FGA2_A2C2f)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 4], 1, Concat, [1]]                     # 13
  - [-1, 2, A2C2f, [256, False, -1]]              # 14 P3 (<- module 5: FGA2_A2C2f)

  # ---- nhanh P2 moi (shallow fusion) ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 2], 1, Concat, [1]]                     # 16  fuse voi backbone P2 (layer 2)
  - [-1, 2, C3k2, [128, False, 0.25]]             # 17  P2/4 out

  # ---- bottom-up (PAN) ----
  - [-1, 1, Conv, [128, 3, 2]]                    # 18
  - [[-1, 14], 1, Concat, [1]]                    # 19
  - [-1, 2, A2C2f, [256, False, -1]]              # 20  P3/8 out

  - [-1, 1, Conv, [256, 3, 2]]                    # 21
  - [[-1, 11], 1, Concat, [1]]                    # 22
  - [-1, 2, A2C2f, [512, False, -1]]              # 23  P4/16 out

  - [-1, 1, Conv, [512, 3, 2]]                    # 24
  - [[-1, 8], 1, Concat, [1]]                     # 25
  - [-1, 2, C3k2, [1024, True]]                   # 26  P5/32 out

  - [[17, 20, 23, 26], 1, Detect, [nc]]           # 27 Detect(P2, P3, P4, P5)