# cfg/base_yolov12n.yaml
# YOLOv12n baseline cho SCoralDet (nc=6)
# Layer index duoc build_model.py tham chieu - KHONG tu y them/bot dong.

nc: 6  # SCoralDet: Euphyllia ancora, Favosites, Platygyra, Sarcophyton, Sinularia, Wavinghand

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]          # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1  P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2  P2 feat (<- module 2: SFDF #1)
  - [-1, 1, Conv,  [256, 3, 2]]         # 3  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4  (<- module 2: SFDF #2)
  - [-1, 1, Conv,  [512, 3, 2]]         # 5  P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6  (<- module 2: SFDF #3)
  - [-1, 1, Conv,  [1024, 3, 2]]        # 7  P5/32 (AMCF chi vao o variant shallow)
  - [-1, 4, A2C2f, [1024, True, 1]]     # 8  (<- module 2: SFDF #4)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 6], 1, Concat, [1]]                     # 10
  - [-1, 2, A2C2f, [512, False, -1]]              # 11 (<- module 5: FGA2_A2C2f)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 4], 1, Concat, [1]]                     # 13
  - [-1, 2, A2C2f, [256, False, -1]]              # 14 (<- module 5: FGA2_A2C2f)

  - [-1, 1, Conv, [256, 3, 2]]                    # 15
  - [[-1, 11], 1, Concat, [1]]                    # 16
  - [-1, 2, A2C2f, [512, False, -1]]              # 17

  - [-1, 1, Conv, [512, 3, 2]]                    # 18
  - [[-1, 8], 1, Concat, [1]]                     # 19
  - [-1, 2, C3k2, [1024, True]]                   # 20

  - [[14, 17, 20], 1, Detect, [nc]]               # 21 Detect(P3, P4, P5)