# cfg/base_yolov12n_shallow.yaml
# YOLOv12n + Module 1 (Shallow-feature) - FAITHFUL SF-YOLO 2-head:
#   - AMCF thay Conv@7 (build_model va, stride 1) => bo downsample cuoi: 640->320->160->80->40.
#   - top-down vuon toi stride 4 (160x160), fuse layer 2 & 4 truc tiep trong neck.
#   - giu 2 head P4/P5 o 80x80 + 40x40 (node P3 td idx 14 ton tai nhung KHONG gan head).
# Diem cam (2)=2,4,6,8 va (5)=11,14 TRUNG index voi base_yolov12n.yaml.

nc: 6

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv,  [64, 3, 2]]          # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1  P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2  P2 feat   (<- SFDF #1 ; nguon shallow-fusion)
  - [-1, 1, Conv,  [256, 3, 2]]         # 3  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4            (<- SFDF #2)
  - [-1, 1, Conv,  [512, 3, 2]]         # 5  P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6            (<- SFDF #3)
  - [-1, 1, Conv,  [1024, 3, 1]]        # 7  (<- AMCF: build_model va, stride 1 - KHONG downsample)
  - [-1, 4, A2C2f, [1024, True, 1]]     # 8            (<- SFDF #4)

head:
  # ---- top-down (FPN): vuon toi stride 4 (160x160), fuse layer 2 & 4 ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9   40->80
  - [[-1, 4], 1, Concat, [1]]                     # 10  fuse layer 4 (80x80)
  - [-1, 2, A2C2f, [512, False, -1]]              # 11  P4 td 80x80   (<- FGA2_A2C2f)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12  80->160
  - [[-1, 2], 1, Concat, [1]]                     # 13  fuse layer 2 (160x160)
  - [-1, 2, A2C2f, [256, False, -1]]              # 14  P3 td 160x160 (<- FGA2_A2C2f; KHONG gan head)

  # ---- bottom-up (PAN): 2 head o 80x80 + 40x40 ----
  - [-1, 1, Conv, [256, 3, 2]]                    # 15  160->80
  - [[-1, 11], 1, Concat, [1]]                    # 16
  - [-1, 2, A2C2f, [512, False, -1]]              # 17  P4 out 80x80  (HEAD)

  - [-1, 1, Conv, [512, 3, 2]]                    # 18  80->40
  - [[-1, 8], 1, Concat, [1]]                     # 19
  - [-1, 2, C3k2, [1024, True]]                   # 20  P5 out 40x40  (HEAD)

  - [[17, 20], 1, Detect, [nc]]                   # 21  Detect(P4, P5) - 2 head