# benchmark/sf_yolo/base_yolo11n_shallow.yaml
# SF-YOLO faithful (Zhang et al. 2026) tren base YOLOv11n.
#   - Shallow design: Conv@7 (placeholder) -> build_sf_yolo va thanh AMCF(stride 1)
#     => bo downsample cuoi: 640->320->160->80->40 (backbone sau nhat dung o stride 16).
#   - SFDF thay 4 khoi dac trung backbone C3k2 (idx 2/4/6/8), swap split o idx 6/8.
#   - Giu SPPF + C2PSA (base v11n that su; KHAC base_yolov12n_shallow.yaml da bo SPPF/C2PSA).
#   - Neck top-down vuon toi stride 4 (160x160), fuse layer 2 & 4; 2 head P4/P5 o 80x80 + 40x40.
# Diem cam (build_sf_yolo va theo index nay): SFDF=[2,4,6,8], AMCF=7.

nc: 6  # SCoralDet: Euphyllia ancora, Favosites, Platygyra, Sarcophyton, Sinularia, Wavinghand

scales:
  # [depth, width, max_channels] - giong YOLOv11n
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]          # 0  P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1  P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2  P2 feat (stride 4)  (<- SFDF #1 ; shallow-fuse src)
  - [-1, 1, Conv,  [256, 3, 2]]         # 3  P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4  (stride 8)          (<- SFDF #2 ; shallow-fuse src)
  - [-1, 1, Conv,  [512, 3, 2]]         # 5  P4/16
  - [-1, 2, C3k2,  [512, True]]         # 6  (stride 16)         (<- SFDF #3 ; swap)
  - [-1, 1, Conv,  [1024, 3, 1]]        # 7  (<- AMCF: build va, stride 1 - KHONG downsample)
  - [-1, 2, C3k2,  [1024, True]]        # 8  (stride 16)         (<- SFDF #4 ; swap)
  - [-1, 1, SPPF,  [1024, 5]]           # 9  (stride 16)
  - [-1, 2, C2PSA, [1024]]              # 10 (stride 16)

head:
  # ---- top-down (FPN): vuon toi stride 4 (160x160), fuse layer 2 & 4 ----
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11  40->80 (tu C2PSA@10, stride 16)
  - [[-1, 4], 1, Concat, [1]]                     # 12  fuse layer 4 (80x80, stride 8)
  - [-1, 2, C3k2, [512, False]]                   # 13  P4 td 80x80

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14  80->160
  - [[-1, 2], 1, Concat, [1]]                     # 15  fuse layer 2 (160x160, stride 4)
  - [-1, 2, C3k2, [256, False]]                   # 16  P3 td 160x160 (KHONG gan head)

  # ---- bottom-up (PAN): 2 head o 80x80 + 40x40 ----
  - [-1, 1, Conv, [256, 3, 2]]                    # 17  160->80
  - [[-1, 13], 1, Concat, [1]]                    # 18
  - [-1, 2, C3k2, [512, False]]                   # 19  P4 out 80x80 (HEAD, stride 8)

  - [-1, 1, Conv, [512, 3, 2]]                    # 20  80->40
  - [[-1, 10], 1, Concat, [1]]                    # 21  fuse C2PSA@10 (40x40, stride 16)
  - [-1, 2, C3k2, [1024, True]]                   # 22  P5 out 40x40 (HEAD, stride 16)

  - [[19, 22], 1, Detect, [nc]]                   # 23  Detect(P4, P5) - 2 head