# yolo12n-f3m-stem-only.yaml
# ABLATION: chi F3MWithSA o STEM (tuong ung 'onlyF3MWithSA' trong paper Table 2)
nc: 6
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,      [64, 3, 2]]              # 0-P1/2
  - [-1, 1, F3MWithSA, [0.33, True, 7]]         # 1  <-- STEM only
  - [-1, 1, Conv,      [128, 3, 2]]             # 2-P2/4
  - [-1, 2, C3k2,      [256, False, 0.25]]      # 3
  - [-1, 1, Conv,      [256, 3, 2]]             # 4-P3/8
  - [-1, 2, C3k2,      [512, False, 0.25]]      # 5
  - [-1, 1, Conv,      [512, 3, 2]]             # 6-P4/16
  - [-1, 4, A2C2f,     [512, True, 4]]          # 7
  - [-1, 1, Conv,      [1024, 3, 2]]            # 8-P5/32
  - [-1, 4, A2C2f,     [1024, True, 1]]         # 9
  - [-1, 1, SPPF,      [1024, 5]]               # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 11
  - [[-1, 7], 1, Concat, [1]]                   # 12
  - [-1, 2, A2C2f, [512, False, -1]]            # 13
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 14
  - [[-1, 5], 1, Concat, [1]]                   # 15
  - [-1, 2, A2C2f, [256, False, -1]]            # 16 (P3/8)
  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18
  - [-1, 2, A2C2f, [512, False, -1]]            # 19 (P4/16)
  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 10], 1, Concat, [1]]                  # 21
  - [-1, 2, C3k2, [1024, True]]                 # 22 (P5/32)
  - [[16, 19, 22], 1, Detect, [nc]]             # 23 Detect
