# yolo12n-f3m.yaml
# ============================================================
# YOLOv12n + F3M (su ket hop DAY DU 2 module)
#   - STEM  : F3MWithSA (r=0.33,  gate=True ) -> early high-res features
#   - NECK  : F3M       (r=0.125, gate=False) -> pre-SPPF, deep features
# Paper Section 2.2.1 (Integration Strategy)
# ============================================================

nc: 6  # SCoralDet: 6 lop soft-coral (chinh theo dataset cua ban)

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,      [64, 3, 2]]              # 0-P1/2
  # ---- STEM: thay Conv thu 2 bang F3MWithSA ----
  - [-1, 1, F3MWithSA, [0.33, True, 7]]         # 1  (r=0.33, gate=T, k=7)
  - [-1, 1, Conv,      [128, 3, 2]]             # 2-P2/4
  - [-1, 2, C3k2,      [256, False, 0.25]]      # 3
  - [-1, 1, Conv,      [256, 3, 2]]             # 4-P3/8
  - [-1, 2, C3k2,      [512, False, 0.25]]      # 5
  - [-1, 1, Conv,      [512, 3, 2]]             # 6-P4/16
  - [-1, 4, A2C2f,     [512, True, 4]]          # 7
  - [-1, 1, Conv,      [1024, 3, 2]]            # 8-P5/32
  - [-1, 4, A2C2f,     [1024, True, 1]]         # 9
  # ---- NECK pre-SPPF: chen F3M lite ----
  - [-1, 1, F3M,       [0.125, False]]          # 10 (r=0.125, gate=F)
  - [-1, 1, SPPF,      [1024, 5]]               # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 12
  - [[-1, 7], 1, Concat, [1]]                   # 13
  - [-1, 2, A2C2f, [512, False, -1]]            # 14

  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 15
  - [[-1, 5], 1, Concat, [1]]                   # 16
  - [-1, 2, A2C2f, [256, False, -1]]            # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 18
  - [[-1, 14], 1, Concat, [1]]                  # 19
  - [-1, 2, A2C2f, [512, False, -1]]            # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 21
  - [[-1, 11], 1, Concat, [1]]                  # 22
  - [-1, 2, C3k2, [1024, True]]                 # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]             # 24 Detect(P3, P4, P5)
